let menuAray = ['ต้มจืดเต้าหู้หมูสับ', 'ต้มจืดไข่น้ำ', 'ต้มจืดสาหร่าย', 'ต้มเลือดหมู', 'ต้มยำไก่', 'ต้มยำกุ้ง', 'ต้มยำปลากระป๋อง', 'ต้มยำปลาทู', 'ต้มข่าไก่','ข้าวผัด', 'ข้าวผัดน้ำพริกปลาทู', 'ข้าวผัดน้ำพริกนรก', 'ข้าวผัดอเมริกัน', 'ผัดกะเพรา', 'ผัดซีอิ๊ว', 'ผัดผงกะหรี่', 'ผัดฉ่าทะเล', 'ผัดมักกะโรนีซอสมะเขือเทศ', 'มาม่าผัดขี้เมาทะเล', 'ผัดผักรวมมิตร', 'ผัดคะน้าหมูกรอบ', 'ผัดบล็อคโคลี่กุ้ง', 'ผัดพริกแกง', 'แกงส้ม', 'แกงเขียวหวาน', 'แกงป่า', 'แกงเผ็ด', 'แกงคั่วหอยใบชะพลู', 'แกงพะแนง', 'แกงเลียง', 'ไข่เจียวหมูสับ', 'หมูทอดกระเทียม', 'หมูคั่วพริกเกลือ', 'หมูสามชั้นทอดเกลือ', 'ปีกไก่ทอดน้ำปลา', 'หมูแดดเดียวทอด', 'เนื้อแดดเดียวทอด', 'ทอดมันกุ้ง', 'ยำหมูยอ', 'ยำไข่ดาว', 'ยำวุ้นเส้นหมูสับ', 'ยำไส้กรอก', 'ยำแหนม', 'ยำกุนเชียง', 'ยำปลากระป๋อง', 'ยำมาม่ารวมมิตร', 'ยำวุ้นเส้นรวมมิตร'];

let randomButton = document.getElementById('button');
let output = document.getElementById('output');

randomButton.addEventListener('click', () => {
    let n = menuAray.length;
    let index = Math.floor(Math.random() * n);
    let menu = menuAray[index];
    output.innerHTML = menu;
})